Updated README and Guides
